Project/Toir/src/Reports/торо_СтатусыРемонтовПоЗаявкам/торо_СтатусыРемонтовПоЗаявкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>торо_СтатусыРемонтовПоЗаявкам</name>
</mdclass:Report>

Project/Toir/src/InformationRegisters/торо_СтатусыРемонтовВЗаявках/торо_СтатусыРемонтовВЗаявках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_СтатусыРемонтовВЗаявках</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.торо_СтатусыДокументов</types>
    </type>
  </resources>
  <resources>
    <name>КомментарийКСтатусу</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <attributes>
    <name>ДокументИсточник</name>
    <type>
      <types>DocumentRef.торо_ЗакрытиеЗаявокИРемонтов</types>
      <types>DocumentRef.торо_НарядНаРегламентноеМероприятие</types>
      <types>DocumentRef.торо_НарядНаВыполнениеРемонтныхРабот</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      <types>DocumentRef.торо_АктОВыполненииЭтапаРабот</types>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗаявкаНаРемонт</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДРемонта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Catalogs/торо_СтруктурыОР/торо_СтруктурыОР.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>торо_СтруктурыОР</name>
  <predefined>
    <items>
      <name>ОсновнаяИерархия</name>
      <description>Основная иерархия</description>
    </items>
    <items>
      <name>СтруктураПоМестонахождению</name>
      <description>Структура по местонахождению</description>
    </items>
    <items>
      <name>СтруктураПоТехнологическойПозиции</name>
      <description>Структура по технологической позиции</description>
    </items>
  </predefined>
  <attributes>
    <name>ИзменяетсяДокументами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешенВводНовыхОР</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтроитсяАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипРеквизитаОР</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечныеЭлементыВДереве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Reports/торо_СтатусыРемонтовПоЗаявкам/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Идентификатор = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИерархияТип")).ИдентификаторПользовательскойНастройки;
	СтрокаПараметр = КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(Идентификатор);
	
	Если СтрокаПараметр <> Неопределено И ЗначениеЗаполнено(СтрокаПараметр.Значение) Тогда
		ТекИерархия = СтрокаПараметр.Значение;
	Иначе
		ТекИерархия = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(
			"НастройкиТОиР",
			"ОсновнаяСтруктураИерархии",
			Справочники.торо_СтруктурыОР.ПустаяСсылка());
			
		Если СтрокаПараметр <> Неопределено Тогда
			СтрокаПараметр.Значение = ТекИерархия;
		КонецЕсли;
		
	КонецЕсли;
	
	торо_ОтчетыСервер.УстановитьЗапросыНаборовДанныхИерархииОР(СхемаКомпоновкиДанных, ТекИерархия, "КонецПериода");
	
	Если ТекИерархия.СтроитсяАвтоматически Тогда
				
		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос =
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Данные.ЗаявкаНаРемонт,
		|	ВТ_Данные.ИДРемонта,
		|	ВТ_Данные.Статус,
		|	ВТ_Данные.КомментарийКСтатусу,
		|	ВТ_Данные.Исполнитель,
		|	ВТ_Данные.ДатаИзмененияСтатуса,
		|	ВТ_Данные.ТекущийСтатус,
		|	ВТ_Данные.ПользовательТекущийСтатус,
		|	ВТ_Данные.ОбъектРемонта,
		|	ВТ_Данные.ВидРемонтныхРабот,
		|	ВТ_Данные.ДатаНачала,
		|	ВТ_Данные.ДатаОкончания,
		|	торо_ОбъектыРемонта." + ТекИерархия.РеквизитОР + " КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ВТ_Данные.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка
		|";
		
		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.Иерархия);
		
	Иначе

		торо_ОтчетыКлиентСервер.УстановитьТипИерархическойГруппировкиВНастройках(КомпоновщикНастроек, "ОбъектИерархии", ТипГруппировкиКомпоновкиДанных.ТолькоИерархия);

		СхемаКомпоновкиДанных.НаборыДанных.Объекты.Запрос = 
		ПолучитьСодержательнуюЧастьЗапроса()+
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВТ_Данные.ЗаявкаНаРемонт,
		|	ВТ_Данные.ИДРемонта,
		|	ВТ_Данные.Статус,
		|	ВТ_Данные.КомментарийКСтатусу,
		|	ВТ_Данные.Исполнитель,
		|	ВТ_Данные.ДатаИзмененияСтатуса,
		|	ВТ_Данные.ТекущийСтатус,
		|	ВТ_Данные.ПользовательТекущийСтатус,
		|	ВТ_Данные.ОбъектРемонта,
		|	ВТ_Данные.ВидРемонтныхРабот,
		|	ВТ_Данные.ДатаНачала,
		|	ВТ_Данные.ДатаОкончания,
		|	ВТ_Данные.ОбъектРемонта КАК ОбъектИерархии
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.торо_ОбъектыРемонта КАК торо_ОбъектыРемонта
		|		ПО ВТ_Данные.ОбъектРемонта = торо_ОбъектыРемонта.Ссылка";
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСодержательнуюЧастьЗапроса() 
	
	ЗапросТекст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_СтатусыРемонтовВЗаявках.Период КАК Период,
	|	торо_СтатусыРемонтовВЗаявках.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт,
	|	торо_СтатусыРемонтовВЗаявках.ИДРемонта КАК ИДРемонта,
	|	торо_СтатусыРемонтовВЗаявках.Статус КАК Статус,
	|	торо_СтатусыРемонтовВЗаявках.КомментарийКСтатусу КАК КомментарийКСтатусу,
	|	торо_СтатусыРемонтовВЗаявках.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ ВТ_ИсторияСтатусов
	|ИЗ
	|	РегистрСведений.торо_СтатусыРемонтовВЗаявках КАК торо_СтатусыРемонтовВЗаявках
	|{ГДЕ
	|	(торо_СтатусыРемонтовВЗаявках.Период >= &НачалоПериода),
	|	(торо_СтатусыРемонтовВЗаявках.Период <= &КонецПериода)}
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаявкаНаРемонт,
	|	ИДРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт,
	|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.ИДРемонта КАК ИДРемонта,
	|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.Статус КАК Статус,
	|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.КомментарийКСтатусу КАК КомментарийКСтатусу,
	|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.Пользователь КАК Пользователь
	|ПОМЕСТИТЬ ВТ_ТекущиеСтатусыРемонтов
	|ИЗ
	|	РегистрСведений.торо_СтатусыРемонтовВЗаявках.СрезПоследних(
	|			&ПериодТекущихСтатусов {(&ПериодТекущихСтатусов)},
	|			(ЗаявкаНаРемонт, ИДРемонта) В
	|				(ВЫБРАТЬ
	|					ВТ_ИсторияСтатусов.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт,
	|					ВТ_ИсторияСтатусов.ИДРемонта КАК ИДРемонта
	|				ИЗ
	|					ВТ_ИсторияСтатусов КАК ВТ_ИсторияСтатусов)) КАК торо_СтатусыРемонтовВЗаявкахСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаявкаНаРемонт,
	|	ИДРемонта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_ИсторияСтатусов.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт,
	|	ВТ_ИсторияСтатусов.ИДРемонта КАК ИДРемонта,
	|	ВТ_ИсторияСтатусов.Статус КАК Статус,
	|	ВТ_ИсторияСтатусов.КомментарийКСтатусу КАК КомментарийКСтатусу,
	|	ВТ_ИсторияСтатусов.Пользователь КАК Исполнитель,
	|	ВТ_ИсторияСтатусов.Период КАК ДатаИзмененияСтатуса,
	|	ВТ_ТекущиеСтатусыРемонтов.Статус КАК ТекущийСтатус,
	|	ВТ_ТекущиеСтатусыРемонтов.Пользователь КАК ПользовательТекущийСтатус,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания КАК ДатаОкончания
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	ВТ_ИсторияСтатусов КАК ВТ_ИсторияСтатусов
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущиеСтатусыРемонтов КАК ВТ_ТекущиеСтатусыРемонтов
	|		ПО ВТ_ИсторияСтатусов.ЗаявкаНаРемонт = ВТ_ТекущиеСтатусыРемонтов.ЗаявкаНаРемонт
	|			И ВТ_ИсторияСтатусов.ИДРемонта = ВТ_ТекущиеСтатусыРемонтов.ИДРемонта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	|		ПО ВТ_ИсторияСтатусов.ИДРемонта = торо_ЗаявкаНаРемонтРемонтыОборудования.ID
	|			И (ВТ_ТекущиеСтатусыРемонтов.ЗаявкаНаРемонт = торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ОбъектРемонта"

	
	//"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт,
	//|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.ИДРемонта КАК ИДРемонта,
	//|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.Статус КАК Статус,
	//|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.КомментарийКСтатусу КАК КомментарийКСтатусу,
	//|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.Пользователь КАК Пользователь
	//|ПОМЕСТИТЬ ВТ_ТекущиеСтатусыРемонтов
	//|ИЗ
	//|	РегистрСведений.торо_СтатусыРемонтовВЗаявках.СрезПоследних КАК торо_СтатусыРемонтовВЗаявкахСрезПоследних
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ИДРемонта,
	//|	ЗаявкаНаРемонт
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт,
	//|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.ИДРемонта КАК ИДРемонта,
	//|	торо_СтатусыРемонтовВЗаявкахСрезПоследних.Пользователь КАК Пользователь
	//|ПОМЕСТИТЬ ВТ_ПоследниеИсполнители
	//|ИЗ
	//|	РегистрСведений.торо_СтатусыРемонтовВЗаявках.СрезПоследних(, Статус В (&СтатусыВРаботе)) КАК торо_СтатусыРемонтовВЗаявкахСрезПоследних
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ИДРемонта,
	//|	ЗаявкаНаРемонт
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ВТ_ТекущиеСтатусыРемонтов.ЗаявкаНаРемонт КАК ЗаявкаНаРемонт,
	//|	ВТ_ТекущиеСтатусыРемонтов.ИДРемонта КАК ИДРемонта,
	//|	ВТ_ТекущиеСтатусыРемонтов.Статус КАК Статус,
	//|	ВТ_ТекущиеСтатусыРемонтов.КомментарийКСтатусу КАК КомментарийКСтатусу,
	//|	ЕСТЬNULL(ВТ_ПоследниеИсполнители.Пользователь, ВТ_ТекущиеСтатусыРемонтов.Пользователь) КАК Исполнитель,
	//|	торо_ЗаявкаНаРемонтРемонтыОборудования.ОбъектРемонта КАК ОбъектРемонта,
	//|	торо_ЗаявкаНаРемонтРемонтыОборудования.ВидРемонтныхРабот КАК ВидРемонтныхРабот,
	//|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаНачала КАК ДатаНачала,
	//|	торо_ЗаявкаНаРемонтРемонтыОборудования.ДатаОкончания КАК ДатаОкончания
	//|ПОМЕСТИТЬ ВТ_Данные
	//|ИЗ
	//|	ВТ_ТекущиеСтатусыРемонтов КАК ВТ_ТекущиеСтатусыРемонтов
	//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.торо_ЗаявкаНаРемонт.РемонтыОборудования КАК торо_ЗаявкаНаРемонтРемонтыОборудования
	//|		ПО ВТ_ТекущиеСтатусыРемонтов.ИДРемонта = торо_ЗаявкаНаРемонтРемонтыОборудования.ID
	//|			И ВТ_ТекущиеСтатусыРемонтов.ЗаявкаНаРемонт = торо_ЗаявкаНаРемонтРемонтыОборудования.Ссылка
	//|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ПоследниеИсполнители КАК ВТ_ПоследниеИсполнители
	//|		ПО ВТ_ТекущиеСтатусыРемонтов.ИДРемонта = ВТ_ПоследниеИсполнители.ИДРемонта
	//|			И ВТ_ТекущиеСтатусыРемонтов.ЗаявкаНаРемонт = ВТ_ПоследниеИсполнители.ЗаявкаНаРемонт
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ОбъектРемонта"
	
	+ "
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|";
	
	Возврат ЗапросТекст;
	
КонецФункции

#КонецОбласти
